vignettes/IPA.org
#+TITLE: Index of Prediction Accuracy (IPA)
#+OPTIONS: H:3 num:t toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS: TeX:t LaTeX:t skip:nil d:t todo:t pri:nil tags:not-in-toc author:nil
#+LaTeX_CLASS: org-article
#+LaTeX_HEADER:\usepackage{authblk}
#+LaTeX_HEADER:\usepackage{natbib}
#+LaTeX_HEADER:\author{Thomas A Gerds}
#+LaTeX_HEADER:\affil{University of Copenhagen, Department of Public Health, Section of Biostatistics, Copenhagen, Denmark}
#+LaTeX_HEADER:\author{Michael W Kattan}
#+LaTeX_HEADER:\affil{Cleveland Clinic, Department of Quantitative Health Sciences, Cleveland, Ohio, USA}

* Introduction

This vignette demonstrates how our software calculates the index of
prediction accuracy[fn:2][fn:4]. We distinguish three settings:

- uncensored binary outcome
- right censored survival outcome (no competing risks)
- right censored time to event outcome with competing risks 

The Brier score is a loss type metric of prediction performance where
lower values correspond to better prediction performance. The IPA
formula for a model is very much the same as the formula for R^2 in a
standard linear regression model:

\begin{equation*}
\operatorname{IPA} = 1-\frac{\text{BrierScore(Prediction model)}}{\text{BrierScore(Null model)}}
\end{equation*}

* Package version

#+ATTR_LATEX: :options otherkeywords={}, deletekeywords={}
#+BEGIN_SRC R  :results output  :exports results  :session *R* :cache yes  :eval always
library(data.table)
library(survival)
library(riskRegression)
library(Publish)
cat("data.table:")
packageVersion("data.table")
cat("\nsurvival:")
packageVersion("survival")
cat("\nriskRegression:")
packageVersion("riskRegression")
cat("\nPublish:")
packageVersion("Publish")
#+END_SRC

#+RESULTS[(2025-09-05 15:48:49) f47684812cfced1ee3e11c1d127ff83471a909ef]:
: data.table:[1] ‘1.17.8’
: 
: survival:[1] ‘3.8.3’
: 
: riskRegression:[1] ‘2025.9.5’
: 
: Publish:[1] ‘2025.7.24’


* Data

For the purpose of illustrating our software we simulate data alike
the data of an active surveillance prostate cancer
study [fn:1]. Specifically, we generate a learning set (n=278) and a
validation set (n=208). In both data sets we define a binary outcome
variable for the progression status after one year. Note that smallest
censored event time is larger than 1 year, and hence the event status
after one year is uncensored. 

#+name:loaddata
#+ATTR_LATEX: :options otherkeywords={}, deletekeywords={library,data,table,set,time,*,&}
#+BEGIN_SRC R  :results output raw drawer  :exports code  :session *R* :cache no  :eval always
set.seed(18)
astrain <- simActiveSurveillance(278)
astest <- simActiveSurveillance(208)
astrain[,Y1:=1*(event==1 & time<=1)]
astest[,Y1:=1*(event==1 & time<=1)]
#+END_SRC

#+RESULTS: loaddata
:results:
:end:

[fn:1] Berg KD, Vainer B, Thomsen FB, Roeder MA, Gerds TA, Toft BG, Brasso K, and Iversen P. Erg protein expression in diagnostic specimens is associated with increased risk of progression during active surveillance for prostate cancer. European urology, 66(5):851--860, 2014.

