vignettes/IPA.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-11-04 Mon 12:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Index of Prediction Accuracy (IPA)</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="https://publicifsv.sund.ku.dk/~tag/styles/practicals.css" />
</head>
<body>
<div id="content">
<h1 class="title">Index of Prediction Accuracy (IPA)</h1>

<div id="outline-container-org625facd" class="outline-2">
<h2 id="org625facd"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This vignette demonstrates how our software calculates the index of
prediction accuracy <sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup>. We distinguish three settings:
</p>

<ul class="org-ul">
<li>uncensored binary outcome</li>
<li>right censored survival outcome (no competing risks)</li>
<li>right censored time to event outcome with competing risks</li>
</ul>

<p>
The Brier score is a loss type metric of prediction performance where
lower values correspond to better prediction performance. The IPA
formula for a model is very much the same as the formula for R<sup>2</sup> in a
standard linear regression model:
</p>

\begin{equation*}
\operatorname{IPA} = 1-\frac{\text{BrierScore(Prediction model)}}{\text{BrierScore(Null model)}}
\end{equation*}
</div>
</div>

<div id="outline-container-org4fcc2fd" class="outline-2">
<h2 id="org4fcc2fd"><span class="section-number-2">2</span> Package version</h2>
<div class="outline-text-2" id="text-2">
<pre class="example">
data.table:&gt; [1] ‘1.12.2’

survival:&gt; [1] ‘2.44.1.1’

riskRegression:&gt; [1] ‘2019.11.3’

Publish:&gt; [1] ‘2019.11.2’
</pre>
</div>
</div>

<div id="outline-container-orgc609040" class="outline-2">
<h2 id="orgc609040"><span class="section-number-2">3</span> Data</h2>
<div class="outline-text-2" id="text-3">
<p>
For the purpose of illustrating our software we simulate data alike
the data of an active surveillance prostate cancer
study <sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup>. Specifically, we generate a learning set (n=278) and a
validation set (n=208). In both data sets we define a binary outcome
variable for the progression status after one year. Note that smallest
censored event time is larger than 1 year, and hence the event status
after one year is uncensored. 
</p>

<div class="org-src-container">
<pre class="src src-R" id="org67d0c35">set.seed(18)
astrain <span style="color: #008b8b;">&lt;-</span> simActiveSurveillance(278)
astest <span style="color: #008b8b;">&lt;-</span> simActiveSurveillance(208)
astrain[,Y1:=1*(event==1 &amp; time&lt;=1)]
astest[,Y1:=1*(event==1 &amp; time&lt;=1)]
</pre>
</div>
</div>
</div>
