vignettes/IPA.org
* IPA for a binary outcome 
:PROPERTIES:
:CUSTOM_ID: sec:binary
:END:

To illustrate the binary outome setting we analyse the 1-year
progression status. We have complete 1-year followup, i.e., no dropout
or otherwise censored data before 1 year. We fit two logistic
regression models, one including and one excluding the biomarker
=erg.status=:

#+ATTR_LATEX: :options otherkeywords={}, deletekeywords={glm,family,status,data}
#+BEGIN_SRC R  :results output raw drawer :exports both  :session *R* :cache yes :var data=loaddata
lrfit.ex <- glm(Y1~age+lpsaden+ppb5+lmax+ct1+diaggs,data=astrain,family="binomial")
lrfit.inc <- glm(Y1~age+lpsaden+ppb5+lmax+ct1+diaggs+erg.status,data=astrain,family="binomial")
publish(lrfit.inc,org=TRUE)
#+END_SRC

#+RESULTS[(2025-09-05 15:48:50) 4ad587463242261d838b316f44356bc6b6112649]:
:results:
| Variable   | Units | OddsRatio | CI.95       | p-value |
|------------+-------+-----------+-------------+---------|
| age        |       |      0.98 | [0.90;1.06] |  0.6459 |
| lpsaden    |       |      0.95 | [0.66;1.36] |  0.7747 |
| ppb5       |       |      1.09 | [0.92;1.28] |  0.3224 |
| lmax       |       |      1.08 | [0.83;1.41] |  0.5566 |
| ct1        | cT1   |       Ref |             |         |
|            | cT2   |      1.00 | [0.29;3.41] |  0.9994 |
| diaggs     | GNA   |       Ref |             |         |
|            | 3/3   |      0.60 | [0.27;1.34] |  0.2091 |
|            | 3/4   |      0.25 | [0.05;1.30] |  0.1006 |
| erg.status | neg   |       Ref |             |         |
|            | pos   |      3.66 | [1.90;7.02] | <0.0001 |
:end:


Based on these models we predict the risk of progression within one
year in the validation set.

#+ATTR_LATEX: :options otherkeywords={}, deletekeywords={c}
#+BEGIN_SRC R  :results output raw drawer  :exports both  :session *R* :cache yes  :eval always
astest[,risk.ex:=100*predictRisk(lrfit.ex,newdata=astest)]
astest[,risk.inc:=100*predictRisk(lrfit.inc,newdata=astest)]
publish(head(astest[,-c(8,9)]),digits=1,org=TRUE)
#+END_SRC

#+RESULTS[(2025-09-05 15:48:50) 1b832f895d12a85feea8e807fa4ca3edced723a1]:
:results:
|  age | lpsaden | ppb5 | lmax | ct1 | diaggs | erg.status |  Y1 | risk.ex | risk.inc |
|------+---------+------+------+-----+--------+------------+-----+---------+----------|
| 62.6 |    -3.2 |  4.9 |  4.6 | cT1 | 3/3    | pos        | 0.0 |    23.2 |     36.3 |
| 66.9 |    -1.7 |  0.7 |  4.1 | cT1 | 3/3    | pos        | 1.0 |    14.0 |     24.7 |
| 65.4 |    -1.5 |  4.0 |  3.9 | cT1 | 3/3    | neg        | 0.0 |    17.4 |     10.6 |
| 59.0 |    -2.8 |  6.8 |  3.3 | cT2 | 3/4    | pos        | 1.0 |    10.7 |     21.1 |
| 55.6 |    -3.5 |  2.8 |  3.0 | cT1 | 3/3    | neg        | 0.0 |    21.9 |     11.8 |
| 71.1 |    -2.6 |  3.3 |  3.7 | cT1 | 3/3    | neg        | 0.0 |    15.0 |      9.5 |
:end:


To calculate the Index of Prediction Accuracy (IPA) we call the
=Score= function as follows on a list which includes the two logistic
regression models.

#+ATTR_LATEX: :options otherkeywords={}, deletekeywords={list,time,summary,formula,se,contrasts,data}
#+BEGIN_SRC R  :results output  :exports both  :session *R* :cache yes  :eval always
X1 <- Score(list("Exclusive ERG"=lrfit.ex,"Inclusive ERG"=lrfit.inc),data=astest,
            formula=Y1~1,summary="ipa",se.fit=1L,metrics="brier",contrasts=FALSE)
X1
#+END_SRC

#+RESULTS[(2025-09-05 15:49:20) 2ec582cdb0ab737228c55ae00f0d6f7b96b3bdb4]:
#+begin_example

Summary statistics IPA:

Results by model:

Key: <model>
           model    IPA  lower  upper
          <fctr> <char> <char> <char>
1: Exclusive ERG    2.7   -1.6    6.9
2: Inclusive ERG    7.3    0.4   14.2

NOTE: Values are multiplied by 100 and given in %.
NOTE: The higher IPA the better.

Metric Brier:

Results by model:

           model  Brier  lower  upper
          <fctr> <char> <char> <char>
1:    Null model   15.2   11.9   18.6
2: Exclusive ERG   14.8   11.5   18.2
3: Inclusive ERG   14.1   11.1   17.2

NOTE: Values are multiplied by 100 and given in %.
NOTE: The lower Brier the better.
#+end_example


Both logistic regression models have a lower Brier score than the
=Null model= which ignores all predictor variables. Hence, both models
have a positive IPA. The logistic regression model which excludes the
ERG biomarker scores IPA=2.68% and the logistic regression model which
includes the ERG biomarer scores IPA = 7.29%. The difference in IPA
between the two models is 4.62%. This means that when we omit
=erg.status= from the model, then we loose 4.62% in IPA compared to
the full model. It is sometimes interesting to compare the predictor
variables according to how much they contribute to the prediction
performance. Generally, this is a non-trivial task which depends on
the order in which the variables are entered into the model, the
functional form and also on the type of model. However, we can drop
one variable at a time from the full model and for each variable
compute the loss in IPA as the difference between IPA of the full
model and IPA of the model where the variable is omitted.

#+ATTR_LATEX: :options otherkeywords={}, deletekeywords={}
#+BEGIN_SRC R  :results output   :exports both  :session *R* :cache yes  :eval always
IPA(lrfit.inc,newdata=astest)
#+END_SRC

#+RESULTS[(2025-09-05 15:48:50) 0a14f54e5393497b5ed8baf2e0ffce5d57ed4e7f]:
#+begin_example
     Variable  Brier    IPA IPA.drop
       <fctr> <char> <char>   <char>
1: Null model   15.2    0.0      7.3
2: Full model   14.1    7.3      0.0
3:        age   14.1    7.4     -0.1
4:    lpsaden   14.1    7.6     -0.3
5:       ppb5   14.2    6.9      0.4
6:       lmax   14.1    7.2      0.1
7:        ct1   14.1    7.3     -0.0
8:     diaggs   14.6    4.4      2.9
9: erg.status   14.8    2.7      4.6

NOTE: Values are multiplied by 100 and given in %.
NOTE: The higher IPA the better.
NOTE: IPA.drop = IPA(Full model) - IPA. The higher the drop
the more important is the variable for the full model.
#+end_example

