vignettes/IPA.html

<div id="outline-container-org1eda45c" class="outline-2">
<h2 id="sec:binary"><span class="section-number-2">4</span> IPA for a binary outcome</h2>
<div class="outline-text-2" id="text-sec:binary">
<p>
To illustrate the binary outome setting we analyse the 1-year
progression status. We have complete 1-year followup, i.e., no dropout
or otherwise censored data before 1 year. We fit two logistic
regression models, one including and one excluding the biomarker
<code>erg.status</code>:
</p>

<div class="org-src-container">
<pre class="src src-R">lrfit.ex <span style="color: #008b8b;">&lt;-</span> glm(Y1~age+lpsaden+ppb5+lmax+ct1+diaggs,data=astrain,family=<span style="color: #8b2252;">"binomial"</span>)
lrfit.inc <span style="color: #008b8b;">&lt;-</span> glm(Y1~age+lpsaden+ppb5+lmax+ct1+diaggs+erg.status,data=astrain,family=<span style="color: #8b2252;">"binomial"</span>)
publish(lrfit.inc,org=<span style="color: #228b22;">TRUE</span>)
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Units</th>
<th scope="col" class="org-right">OddsRatio</th>
<th scope="col" class="org-left">CI.95</th>
<th scope="col" class="org-right">p-value</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">age</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">0.98</td>
<td class="org-left">[0.90;1.06]</td>
<td class="org-right">0.6459</td>
</tr>

<tr>
<td class="org-left">lpsaden</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">0.95</td>
<td class="org-left">[0.66;1.36]</td>
<td class="org-right">0.7747</td>
</tr>

<tr>
<td class="org-left">ppb5</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">1.09</td>
<td class="org-left">[0.92;1.28]</td>
<td class="org-right">0.3224</td>
</tr>

<tr>
<td class="org-left">lmax</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">1.08</td>
<td class="org-left">[0.83;1.41]</td>
<td class="org-right">0.5566</td>
</tr>

<tr>
<td class="org-left">ct1</td>
<td class="org-left">cT1</td>
<td class="org-right">Ref</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">cT2</td>
<td class="org-right">1.00</td>
<td class="org-left">[0.29;3.41]</td>
<td class="org-right">0.9994</td>
</tr>

<tr>
<td class="org-left">diaggs</td>
<td class="org-left">GNA</td>
<td class="org-right">Ref</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">3/3</td>
<td class="org-right">0.60</td>
<td class="org-left">[0.27;1.34]</td>
<td class="org-right">0.2091</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">3/4</td>
<td class="org-right">0.25</td>
<td class="org-left">[0.05;1.30]</td>
<td class="org-right">0.1006</td>
</tr>

<tr>
<td class="org-left">erg.status</td>
<td class="org-left">neg</td>
<td class="org-right">Ref</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">pos</td>
<td class="org-right">3.66</td>
<td class="org-left">[1.90;7.02]</td>
<td class="org-right">&lt;0.0001</td>
</tr>
</tbody>
</table>

<p>
Based on these models we predict the risk of progression within one
year in the validation set.
</p>

<div class="org-src-container">
<pre class="src src-R">astest[,risk.ex:=100*predictRisk(lrfit.ex,newdata=astest)]
astest[,risk.inc:=100*predictRisk(lrfit.inc,newdata=astest)]
publish(head(astest[,-c(8,9)]),digits=1,org=<span style="color: #228b22;">TRUE</span>)
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">age</th>
<th scope="col" class="org-right">lpsaden</th>
<th scope="col" class="org-right">ppb5</th>
<th scope="col" class="org-right">lmax</th>
<th scope="col" class="org-left">ct1</th>
<th scope="col" class="org-left">diaggs</th>
<th scope="col" class="org-left">erg.status</th>
<th scope="col" class="org-right">Y1</th>
<th scope="col" class="org-right">risk.ex</th>
<th scope="col" class="org-right">risk.inc</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">62.6</td>
<td class="org-right">-3.2</td>
<td class="org-right">4.9</td>
<td class="org-right">4.6</td>
<td class="org-left">cT1</td>
<td class="org-left">3/3</td>
<td class="org-left">pos</td>
<td class="org-right">0.0</td>
<td class="org-right">23.2</td>
<td class="org-right">36.3</td>
</tr>

<tr>
<td class="org-right">66.9</td>
<td class="org-right">-1.7</td>
<td class="org-right">0.7</td>
<td class="org-right">4.1</td>
<td class="org-left">cT1</td>
<td class="org-left">3/3</td>
<td class="org-left">pos</td>
<td class="org-right">1.0</td>
<td class="org-right">14.0</td>
<td class="org-right">24.7</td>
</tr>

<tr>
<td class="org-right">65.4</td>
<td class="org-right">-1.5</td>
<td class="org-right">4.0</td>
<td class="org-right">3.9</td>
<td class="org-left">cT1</td>
<td class="org-left">3/3</td>
<td class="org-left">neg</td>
<td class="org-right">0.0</td>
<td class="org-right">17.4</td>
<td class="org-right">10.6</td>
</tr>

<tr>
<td class="org-right">59.0</td>
<td class="org-right">-2.8</td>
<td class="org-right">6.8</td>
<td class="org-right">3.3</td>
<td class="org-left">cT2</td>
<td class="org-left">3/4</td>
<td class="org-left">pos</td>
<td class="org-right">1.0</td>
<td class="org-right">10.7</td>
<td class="org-right">21.1</td>
</tr>

<tr>
<td class="org-right">55.6</td>
<td class="org-right">-3.5</td>
<td class="org-right">2.8</td>
<td class="org-right">3.0</td>
<td class="org-left">cT1</td>
<td class="org-left">3/3</td>
<td class="org-left">neg</td>
<td class="org-right">0.0</td>
<td class="org-right">21.9</td>
<td class="org-right">11.8</td>
</tr>

<tr>
<td class="org-right">71.1</td>
<td class="org-right">-2.6</td>
<td class="org-right">3.3</td>
<td class="org-right">3.7</td>
<td class="org-left">cT1</td>
<td class="org-left">3/3</td>
<td class="org-left">neg</td>
<td class="org-right">0.0</td>
<td class="org-right">15.0</td>
<td class="org-right">9.5</td>
</tr>
</tbody>
</table>

<p>
To calculate the Index of Prediction Accuracy (IPA) we call the
<code>Score</code> function as follows on a list which includes the two logistic
regression models.
</p>

<div class="org-src-container">
<pre class="src src-R">X1 <span style="color: #008b8b;">&lt;-</span> Score(list(<span style="color: #8b2252;">"Exclusive ERG"</span>=lrfit.ex,<span style="color: #8b2252;">"Inclusive ERG"</span>=lrfit.inc),data=astest,
            formula=Y1~1,summary=<span style="color: #8b2252;">"ipa"</span>,se.fit=0L,metrics=<span style="color: #8b2252;">"brier"</span>,contrasts=<span style="color: #228b22;">FALSE</span>)
X1
</pre>
</div>

<pre class="example">

Metric Brier:

Results by model:

           model Brier IPA
1:    Null model  15.2 0.0
2: Exclusive ERG  14.8 2.7
3: Inclusive ERG  14.1 7.3

NOTE: Values are multiplied by 100 and given in % (use print(...,percent=FALSE) to avoid this.

NOTE: The lower Brier the better, the higher IPA the better.
</pre>

<p>
Both logistic regression models have a lower Brier score than the
<code>Null model</code> which ignores all predictor variables. Hence, both models
have a positive IPA. The logistic regression model which excludes the
ERG biomarker scores IPA=2.68% and the logistic regression model which
includes the ERG biomarer scores IPA = 7.29%. The difference in IPA
between the two models is 4.62%. This means that when we omit
<code>erg.status</code> from the model, then we loose 4.62% in IPA compared to
the full model. It is sometimes interesting to compare the predictor
variables according to how much they contribute to the prediction
performance. Generally, this is a non-trivial task which depends on
the order in which the variables are entered into the model, the
functional form and also on the type of model. However, we can drop
one variable at a time from the full model and for each variable
compute the loss in IPA as the difference between IPA of the full
model and IPA of the model where the variable is omitted.
</p>

<div class="org-src-container">
<pre class="src src-R">IPA(lrfit.inc,newdata=astest)
</pre>
</div>

<pre class="example">
     Variable Brier IPA IPA.drop
1: Null model  15.2 0.0      7.3
2: Full model  14.1 7.3      0.0
3:        age  14.1 7.4     -0.1
4:    lpsaden  14.1 7.6     -0.3
5:       ppb5  14.2 6.9      0.4
6:       lmax  14.1 7.2      0.1
7:        ct1  14.1 7.3     -0.0
8:     diaggs  14.6 4.4      2.9
9: erg.status  14.8 2.7      4.6

NOTE: Values are multiplied by 100 and given in % (use print(...,percent=FALSE) to avoid this.
NOTE: IPA.drop = IPA(Full model) - IPA.
</pre>
</div>
</div>
