vignettes/IPA.org
* IPA for right censored survival outcome 
:PROPERTIES:
:CUSTOM_ID: sec:survival
:END:

To illustrate the survival outome setting we analyse the 3-year
progression-free survival probability. So, that the combined endpoint
is progression or death.  We fit two Cox regression models, one
including and one excluding the biomarker =erg.status=:

#+ATTR_LATEX: :options otherkeywords={}, deletekeywords={glm,family,status,data}
#+BEGIN_SRC R  :results output raw drawer :exports both  :session *R* :cache yes :var data=loaddata
coxfit.ex <- coxph(Surv(time,event!=0)~age+lpsaden+ppb5+lmax+ct1+diaggs,data=astrain,x=TRUE)
coxfit.inc <- coxph(Surv(time,event!=0)~age+lpsaden+ppb5+lmax+ct1+diaggs+erg.status,data=astrain,x=TRUE)
publish(coxfit.inc,org=TRUE)
#+END_SRC

#+RESULTS[(2025-09-05 15:48:50) ab47285b61012d2bca8c73e0eb087b9e08233abe]:
:results:
| Variable   | Units | HazardRatio | CI.95       | p-value |
|------------+-------+-------------+-------------+---------|
| age        |       |        1.03 | [0.99;1.07] |   0.124 |
| lpsaden    |       |        1.10 | [0.94;1.29] |   0.230 |
| ppb5       |       |        1.21 | [1.12;1.30] |  <0.001 |
| lmax       |       |        1.06 | [0.94;1.19] |   0.359 |
| ct1        | cT1   |         Ref |             |         |
|            | cT2   |        0.97 | [0.57;1.66] |   0.916 |
| diaggs     | GNA   |         Ref |             |         |
|            | 3/3   |        0.53 | [0.37;0.76] |  <0.001 |
|            | 3/4   |        0.32 | [0.18;0.58] |  <0.001 |
| erg.status | neg   |         Ref |             |         |
|            | pos   |        1.80 | [1.35;2.38] |  <0.001 |
:end:


Based on these models we predict the risk of progression or death
within 3 years in the validation set.

#+ATTR_LATEX: :options otherkeywords={}, deletekeywords={c}
#+BEGIN_SRC R  :results output raw drawer  :exports both  :session *R* :cache yes  
astest[,risk.ex:=100*predictRisk(coxfit.ex,newdata=astest,times=3)]
astest[,risk.inc:=100*predictRisk(coxfit.inc,newdata=astest,times=3)]
publish(head(astest[,-c(8,9)]),digits=1,org=TRUE)
#+END_SRC

#+RESULTS[(2025-09-05 15:48:50) 5bcf6350ff6f463c8beb576216fb983d9574bfa1]:
:results:
|  age | lpsaden | ppb5 | lmax | ct1 | diaggs | erg.status |  Y1 | risk.ex | risk.inc |
|------+---------+------+------+-----+--------+------------+-----+---------+----------|
| 62.6 |    -3.2 |  4.9 |  4.6 | cT1 | 3/3    | pos        | 0.0 |    67.5 |     80.7 |
| 66.9 |    -1.7 |  0.7 |  4.1 | cT1 | 3/3    | pos        | 1.0 |    48.5 |     60.3 |
| 65.4 |    -1.5 |  4.0 |  3.9 | cT1 | 3/3    | neg        | 0.0 |    67.4 |     60.8 |
| 59.0 |    -2.8 |  6.8 |  3.3 | cT2 | 3/4    | pos        | 1.0 |    51.1 |     70.1 |
| 55.6 |    -3.5 |  2.8 |  3.0 | cT1 | 3/3    | neg        | 0.0 |    41.5 |     35.5 |
| 71.1 |    -2.6 |  3.3 |  3.7 | cT1 | 3/3    | neg        | 0.0 |    65.5 |     57.5 |
:end:



To calculate the Index of Prediction Accuracy (IPA) we call the
=Score= function as follows on a list which includes the two Cox 
regression models.

#+ATTR_LATEX: :options otherkeywords={}, deletekeywords={list,time,summary,formula,se,contrasts,data}
#+BEGIN_SRC R  :results output  :exports both  :session *R* :cache yes  :eval always
X2 <- Score(list("Exclusive ERG"=coxfit.ex,"Inclusive ERG"=coxfit.inc),data=astest,
            formula=Surv(time,event!=0)~1,summary="ipa",se.fit=1L,metrics="brier",contrasts=FALSE,times=3)
X2
#+END_SRC

#+RESULTS[(2025-09-05 15:49:26) 1cb80fc9b6ec838816bc33f8301f4673cb1d47d9]:
#+begin_example

Summary statistics IPA:

Results by model:

Key: <model, times>
           model times    IPA  lower  upper
          <fctr> <num> <char> <char> <char>
1: Exclusive ERG     3    6.4   -2.6   15.4
2: Inclusive ERG     3   17.1    8.3   25.8

NOTE: Values are multiplied by 100 and given in %.
NOTE: The higher IPA the better.

Metric Brier:

Results by model:

           model times  Brier  lower  upper
          <fctr> <num> <char> <char> <char>
1:    Null model     3   24.0   22.6   25.4
2: Exclusive ERG     3   22.4   20.5   24.4
3: Inclusive ERG     3   19.9   17.8   21.9

NOTE: Values are multiplied by 100 and given in %.
NOTE: The lower Brier the better.
#+end_example

It is sometimes interesting to compare the predictor variables
according to how much they contribute to the prediction
performance. Generally, this is a non-trivial task which depends on
the order in which the variables are entered into the model, the
functional form and also on the type of model. However, we can drop
one variable at a time from the full model and for each variable
compute the loss in IPA as the difference between IPA of the full
model and IPA of the model where the variable is omitted.

#+ATTR_LATEX: :options otherkeywords={}, deletekeywords={}
#+BEGIN_SRC R  :results output   :exports both  :session *R* :cache yes  :eval always
IPA(coxfit.inc,newdata=astest,times=3)
#+END_SRC

#+RESULTS[(2025-09-05 15:48:50) f4b18b24db785e34b067d3c4ce6c02234098476e]:
#+begin_example
     Variable times  Brier    IPA IPA.drop
       <fctr> <num> <char> <char>   <char>
1: Null model     3   24.0    0.0     17.1
2: Full model     3   19.9   17.1      0.0
3:        age     3   19.7   17.6     -0.6
4:    lpsaden     3   20.1   16.2      0.8
5:       ppb5     3   21.3   11.2      5.9
6:       lmax     3   19.9   16.7      0.4
7:        ct1     3   19.9   17.0      0.1
8:     diaggs     3   20.8   13.0      4.1
9: erg.status     3   22.4    6.4     10.7

NOTE: Values are multiplied by 100 and given in %.
NOTE: The higher IPA the better.
NOTE: IPA.drop = IPA(Full model) - IPA. The higher the drop
the more important is the variable for the full model.
#+end_example

