vignettes/IPA.html

<div id="outline-container-org8a5549c" class="outline-2">
<h2 id="sec:survival"><span class="section-number-2">5</span> IPA for right censored survival outcome</h2>
<div class="outline-text-2" id="text-sec:survival">
<p>
To illustrate the survival outome setting we analyse the 3-year
progression-free survival probability. So, that the combined endpoint
is progression or death.  We fit two Cox regression models, one
including and one excluding the biomarker <code>erg.status</code>:
</p>

<div class="org-src-container">
<pre class="src src-R">coxfit.ex <span style="color: #008b8b;">&lt;-</span> coxph(Surv(time,event!=0)~age+lpsaden+ppb5+lmax+ct1+diaggs,data=astrain,x=<span style="color: #228b22;">TRUE</span>)
coxfit.inc <span style="color: #008b8b;">&lt;-</span> coxph(Surv(time,event!=0)~age+lpsaden+ppb5+lmax+ct1+diaggs+erg.status,data=astrain,x=<span style="color: #228b22;">TRUE</span>)
publish(coxfit.inc,org=<span style="color: #228b22;">TRUE</span>)
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Units</th>
<th scope="col" class="org-right">HazardRatio</th>
<th scope="col" class="org-left">CI.95</th>
<th scope="col" class="org-right">p-value</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">age</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">1.03</td>
<td class="org-left">[0.99;1.07]</td>
<td class="org-right">0.124</td>
</tr>

<tr>
<td class="org-left">lpsaden</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">1.10</td>
<td class="org-left">[0.94;1.29]</td>
<td class="org-right">0.230</td>
</tr>

<tr>
<td class="org-left">ppb5</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">1.21</td>
<td class="org-left">[1.12;1.30]</td>
<td class="org-right">&lt;0.001</td>
</tr>

<tr>
<td class="org-left">lmax</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">1.06</td>
<td class="org-left">[0.94;1.19]</td>
<td class="org-right">0.359</td>
</tr>

<tr>
<td class="org-left">ct1</td>
<td class="org-left">cT1</td>
<td class="org-right">Ref</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">cT2</td>
<td class="org-right">0.97</td>
<td class="org-left">[0.57;1.66]</td>
<td class="org-right">0.916</td>
</tr>

<tr>
<td class="org-left">diaggs</td>
<td class="org-left">GNA</td>
<td class="org-right">Ref</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">3/3</td>
<td class="org-right">0.53</td>
<td class="org-left">[0.37;0.76]</td>
<td class="org-right">&lt;0.001</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">3/4</td>
<td class="org-right">0.32</td>
<td class="org-left">[0.18;0.58]</td>
<td class="org-right">&lt;0.001</td>
</tr>

<tr>
<td class="org-left">erg.status</td>
<td class="org-left">neg</td>
<td class="org-right">Ref</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">pos</td>
<td class="org-right">1.80</td>
<td class="org-left">[1.35;2.38]</td>
<td class="org-right">&lt;0.001</td>
</tr>
</tbody>
</table>

<p>
Based on these models we predict the risk of progression or death
within 3 years in the validation set.
</p>

<div class="org-src-container">
<pre class="src src-R">astest[,risk.ex:=100*predictRisk(coxfit.ex,newdata=astest,times=3)]
astest[,risk.inc:=100*predictRisk(coxfit.inc,newdata=astest,times=3)]
publish(head(astest[,-c(8,9)]),digits=1,org=<span style="color: #228b22;">TRUE</span>)
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">age</th>
<th scope="col" class="org-right">lpsaden</th>
<th scope="col" class="org-right">ppb5</th>
<th scope="col" class="org-right">lmax</th>
<th scope="col" class="org-left">ct1</th>
<th scope="col" class="org-left">diaggs</th>
<th scope="col" class="org-left">erg.status</th>
<th scope="col" class="org-right">Y1</th>
<th scope="col" class="org-right">risk.ex</th>
<th scope="col" class="org-right">risk.inc</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">62.6</td>
<td class="org-right">-3.2</td>
<td class="org-right">4.9</td>
<td class="org-right">4.6</td>
<td class="org-left">cT1</td>
<td class="org-left">3/3</td>
<td class="org-left">pos</td>
<td class="org-right">0.0</td>
<td class="org-right">67.5</td>
<td class="org-right">80.7</td>
</tr>

<tr>
<td class="org-right">66.9</td>
<td class="org-right">-1.7</td>
<td class="org-right">0.7</td>
<td class="org-right">4.1</td>
<td class="org-left">cT1</td>
<td class="org-left">3/3</td>
<td class="org-left">pos</td>
<td class="org-right">1.0</td>
<td class="org-right">48.5</td>
<td class="org-right">60.3</td>
</tr>

<tr>
<td class="org-right">65.4</td>
<td class="org-right">-1.5</td>
<td class="org-right">4.0</td>
<td class="org-right">3.9</td>
<td class="org-left">cT1</td>
<td class="org-left">3/3</td>
<td class="org-left">neg</td>
<td class="org-right">0.0</td>
<td class="org-right">67.4</td>
<td class="org-right">60.8</td>
</tr>

<tr>
<td class="org-right">59.0</td>
<td class="org-right">-2.8</td>
<td class="org-right">6.8</td>
<td class="org-right">3.3</td>
<td class="org-left">cT2</td>
<td class="org-left">3/4</td>
<td class="org-left">pos</td>
<td class="org-right">1.0</td>
<td class="org-right">51.1</td>
<td class="org-right">70.1</td>
</tr>

<tr>
<td class="org-right">55.6</td>
<td class="org-right">-3.5</td>
<td class="org-right">2.8</td>
<td class="org-right">3.0</td>
<td class="org-left">cT1</td>
<td class="org-left">3/3</td>
<td class="org-left">neg</td>
<td class="org-right">0.0</td>
<td class="org-right">41.5</td>
<td class="org-right">35.5</td>
</tr>

<tr>
<td class="org-right">71.1</td>
<td class="org-right">-2.6</td>
<td class="org-right">3.3</td>
<td class="org-right">3.7</td>
<td class="org-left">cT1</td>
<td class="org-left">3/3</td>
<td class="org-left">neg</td>
<td class="org-right">0.0</td>
<td class="org-right">65.5</td>
<td class="org-right">57.5</td>
</tr>
</tbody>
</table>

<p>
To calculate the Index of Prediction Accuracy (IPA) we call the
<code>Score</code> function as follows on a list which includes the two Cox 
regression models.
</p>

<div class="org-src-container">
<pre class="src src-R">X2 <span style="color: #008b8b;">&lt;-</span> Score(list(<span style="color: #8b2252;">"Exclusive ERG"</span>=coxfit.ex,<span style="color: #8b2252;">"Inclusive ERG"</span>=coxfit.inc),data=astest,
            formula=Surv(time,event!=0)~1,summary=<span style="color: #8b2252;">"ipa"</span>,se.fit=0L,metrics=<span style="color: #8b2252;">"brier"</span>,contrasts=<span style="color: #228b22;">FALSE</span>,times=3)
X2
</pre>
</div>

<pre class="example">

Metric Brier:

Results by model:

           model times Brier  IPA
1:    Null model     3  24.0  0.0
2: Exclusive ERG     3  22.4  6.4
3: Inclusive ERG     3  19.9 17.1

NOTE: Values are multiplied by 100 and given in % (use print(...,percent=FALSE) to avoid this.

NOTE: The lower Brier the better, the higher IPA the better.
</pre>

<p>
It is sometimes interesting to compare the predictor variables
according to how much they contribute to the prediction
performance. Generally, this is a non-trivial task which depends on
the order in which the variables are entered into the model, the
functional form and also on the type of model. However, we can drop
one variable at a time from the full model and for each variable
compute the loss in IPA as the difference between IPA of the full
model and IPA of the model where the variable is omitted.
</p>

<div class="org-src-container">
<pre class="src src-R">IPA(coxfit.inc,newdata=astest,times=3)
</pre>
</div>

<pre class="example">
     Variable times Brier  IPA IPA.drop
1: Null model     3  24.0  0.0     17.1
2: Full model     3  19.9 17.1      0.0
3:        age     3  19.7 17.6     -0.6
4:    lpsaden     3  20.1 16.2      0.8
5:       ppb5     3  21.3 11.2      5.9
6:       lmax     3  19.9 16.7      0.4
7:        ct1     3  19.9 17.0      0.1
8:     diaggs     3  20.8 13.0      4.1
9: erg.status     3  22.4  6.4     10.7

NOTE: Values are multiplied by 100 and given in % (use print(...,percent=FALSE) to avoid this.
NOTE: IPA.drop = IPA(Full model) - IPA.
</pre>
</div>
</div>
